{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 14], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D-578876", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-578876", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-697259", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-697259", "inbound_nodes": [[["Conv2D-578876", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-951160", "trainable": true, "dtype": "float32"}, "name": "Add-951160", "inbound_nodes": [[["Conv2D-578876", 0, 0, {}], ["Conv2D-697259", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-525608", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-525608", "inbound_nodes": [[["Add-951160", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-197369", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-197369", "inbound_nodes": [[["Conv2D-525608", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-9356", "trainable": true, "dtype": "float32"}, "name": "Add-9356", "inbound_nodes": [[["Conv2D-525608", 0, 0, {}], ["Conv2D-197369", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-842892", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-842892", "inbound_nodes": [[["Add-9356", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-846182", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-846182", "inbound_nodes": [[["Conv2D-842892", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-343403", "trainable": true, "dtype": "float32"}, "name": "Add-343403", "inbound_nodes": [[["Conv2D-842892", 0, 0, {}], ["Conv2D-846182", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-233743", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-233743", "inbound_nodes": [[["Add-343403", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-830855", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-830855", "inbound_nodes": [[["Conv2D-233743", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-238443", "trainable": true, "dtype": "float32"}, "name": "Add-238443", "inbound_nodes": [[["Conv2D-233743", 0, 0, {}], ["Conv2D-830855", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-298987", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-298987", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-701929", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-701929", "inbound_nodes": [[["Add-238443", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-752183", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-752183", "inbound_nodes": [[["Flatten-298987", 0, 0, {}], ["Flatten-701929", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-96196", "trainable": true, "dtype": "float32", "units": 1024, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-96196", "inbound_nodes": [[["Concat-752183", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-796811", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-796811", "inbound_nodes": [[["Flatten-298987", 0, 0, {}], ["Dense-96196", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-737057", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-737057", "inbound_nodes": [[["Concat-796811", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Dense-output-232392", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Dense-output-232392", "inbound_nodes": [[["Flatten-298987", 0, 0, {}], ["Dense-737057", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1, "activation": "linear", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Dense-output-232392", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of39.bin", "group1-shard2of39.bin", "group1-shard3of39.bin", "group1-shard4of39.bin", "group1-shard5of39.bin", "group1-shard6of39.bin", "group1-shard7of39.bin", "group1-shard8of39.bin", "group1-shard9of39.bin", "group1-shard10of39.bin", "group1-shard11of39.bin", "group1-shard12of39.bin", "group1-shard13of39.bin", "group1-shard14of39.bin", "group1-shard15of39.bin", "group1-shard16of39.bin", "group1-shard17of39.bin", "group1-shard18of39.bin", "group1-shard19of39.bin", "group1-shard20of39.bin", "group1-shard21of39.bin", "group1-shard22of39.bin", "group1-shard23of39.bin", "group1-shard24of39.bin", "group1-shard25of39.bin", "group1-shard26of39.bin", "group1-shard27of39.bin", "group1-shard28of39.bin", "group1-shard29of39.bin", "group1-shard30of39.bin", "group1-shard31of39.bin", "group1-shard32of39.bin", "group1-shard33of39.bin", "group1-shard34of39.bin", "group1-shard35of39.bin", "group1-shard36of39.bin", "group1-shard37of39.bin", "group1-shard38of39.bin", "group1-shard39of39.bin"], "weights": [{"name": "Conv2D-197369/kernel", "shape": [3, 3, 128, 128], "dtype": "float32"}, {"name": "Conv2D-197369/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv2D-233743/kernel", "shape": [3, 3, 256, 512], "dtype": "float32"}, {"name": "Conv2D-233743/bias", "shape": [512], "dtype": "float32"}, {"name": "Conv2D-525608/kernel", "shape": [3, 3, 64, 128], "dtype": "float32"}, {"name": "Conv2D-525608/bias", "shape": [128], "dtype": "float32"}, {"name": "Conv2D-578876/kernel", "shape": [3, 3, 14, 64], "dtype": "float32"}, {"name": "Conv2D-578876/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv2D-697259/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Conv2D-697259/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv2D-830855/kernel", "shape": [3, 3, 512, 512], "dtype": "float32"}, {"name": "Conv2D-830855/bias", "shape": [512], "dtype": "float32"}, {"name": "Conv2D-842892/kernel", "shape": [3, 3, 128, 256], "dtype": "float32"}, {"name": "Conv2D-842892/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv2D-846182/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Conv2D-846182/bias", "shape": [256], "dtype": "float32"}, {"name": "Dense-737057/kernel", "shape": [1920, 512], "dtype": "float32"}, {"name": "Dense-737057/bias", "shape": [512], "dtype": "float32"}, {"name": "Dense-96196/kernel", "shape": [33664, 1024], "dtype": "float32"}, {"name": "Dense-96196/bias", "shape": [1024], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1408, 1], "dtype": "float32"}, {"name": "dense/bias", "shape": [1], "dtype": "float32"}]}]}