{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 14], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D-872648", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-872648", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-356709", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-356709", "inbound_nodes": [[["Conv2D-872648", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-815986", "trainable": true, "dtype": "float32"}, "name": "Add-815986", "inbound_nodes": [[["Conv2D-872648", 0, 0, {}], ["Conv2D-356709", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-335439", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-335439", "inbound_nodes": [[["Add-815986", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-903412", "trainable": true, "dtype": "float32", "filters": 48, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-903412", "inbound_nodes": [[["Conv2D-335439", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-108174", "trainable": true, "dtype": "float32"}, "name": "Add-108174", "inbound_nodes": [[["Conv2D-335439", 0, 0, {}], ["Conv2D-903412", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-713963", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-713963", "inbound_nodes": [[["Add-108174", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-702848", "trainable": true, "dtype": "float32", "filters": 144, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-702848", "inbound_nodes": [[["Conv2D-713963", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-992542", "trainable": true, "dtype": "float32"}, "name": "Add-992542", "inbound_nodes": [[["Conv2D-713963", 0, 0, {}], ["Conv2D-702848", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-961254", "trainable": true, "dtype": "float32", "filters": 432, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-961254", "inbound_nodes": [[["Add-992542", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-145398", "trainable": true, "dtype": "float32", "filters": 432, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-145398", "inbound_nodes": [[["Conv2D-961254", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-557230", "trainable": true, "dtype": "float32"}, "name": "Add-557230", "inbound_nodes": [[["Conv2D-961254", 0, 0, {}], ["Conv2D-145398", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-325854", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-325854", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-850041", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-850041", "inbound_nodes": [[["Add-557230", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-620465", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-620465", "inbound_nodes": [[["Flatten-325854", 0, 0, {}], ["Flatten-850041", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-330799", "trainable": true, "dtype": "float32", "units": 1024, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-330799", "inbound_nodes": [[["Concat-620465", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout", "inbound_nodes": [[["Dense-330799", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-72556", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-72556", "inbound_nodes": [[["Flatten-325854", 0, 0, {}], ["dropout", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-680396", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-680396", "inbound_nodes": [[["Concat-72556", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.2, "noise_shape": null, "seed": null}, "name": "dropout_1", "inbound_nodes": [[["Dense-680396", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Dense-output-225746", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Dense-output-225746", "inbound_nodes": [[["Flatten-325854", 0, 0, {}], ["dropout_1", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1837, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Dense-output-225746", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of3.bin", "group1-shard2of3.bin", "group1-shard3of3.bin"], "weights": [{"name": "Conv2D-145398/kernel", "shape": [3, 3, 432, 432], "dtype": "float32"}, {"name": "Conv2D-145398/bias", "shape": [432], "dtype": "float32"}, {"name": "Conv2D-335439/kernel", "shape": [3, 3, 16, 48], "dtype": "float32"}, {"name": "Conv2D-335439/bias", "shape": [48], "dtype": "float32"}, {"name": "Conv2D-356709/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "Conv2D-356709/bias", "shape": [16], "dtype": "float32"}, {"name": "Conv2D-702848/kernel", "shape": [3, 3, 144, 144], "dtype": "float32"}, {"name": "Conv2D-702848/bias", "shape": [144], "dtype": "float32"}, {"name": "Conv2D-713963/kernel", "shape": [3, 3, 48, 144], "dtype": "float32"}, {"name": "Conv2D-713963/bias", "shape": [144], "dtype": "float32"}, {"name": "Conv2D-872648/kernel", "shape": [3, 3, 14, 16], "dtype": "float32"}, {"name": "Conv2D-872648/bias", "shape": [16], "dtype": "float32"}, {"name": "Conv2D-903412/kernel", "shape": [3, 3, 48, 48], "dtype": "float32"}, {"name": "Conv2D-903412/bias", "shape": [48], "dtype": "float32"}, {"name": "Conv2D-961254/kernel", "shape": [3, 3, 144, 432], "dtype": "float32"}, {"name": "Conv2D-961254/bias", "shape": [432], "dtype": "float32"}, {"name": "Dense-330799/kernel", "shape": [28544, 1024], "dtype": "float32"}, {"name": "Dense-330799/bias", "shape": [1024], "dtype": "float32"}, {"name": "Dense-680396/kernel", "shape": [1920, 512], "dtype": "float32"}, {"name": "Dense-680396/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1408, 1837], "dtype": "float32"}, {"name": "dense/bias", "shape": [1837], "dtype": "float32"}]}]}