{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 14], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D-623257", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-623257", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-999900", "trainable": true, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-999900", "inbound_nodes": [[["Conv2D-623257", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-371810", "trainable": true, "dtype": "float32"}, "name": "Add-371810", "inbound_nodes": [[["Conv2D-623257", 0, 0, {}], ["Conv2D-999900", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-519806", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-519806", "inbound_nodes": [[["Add-371810", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-719310", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-719310", "inbound_nodes": [[["Conv2D-519806", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-755843", "trainable": true, "dtype": "float32"}, "name": "Add-755843", "inbound_nodes": [[["Conv2D-519806", 0, 0, {}], ["Conv2D-719310", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-576606", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-576606", "inbound_nodes": [[["Add-755843", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-844998", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-844998", "inbound_nodes": [[["Conv2D-576606", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-660458", "trainable": true, "dtype": "float32"}, "name": "Add-660458", "inbound_nodes": [[["Conv2D-576606", 0, 0, {}], ["Conv2D-844998", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-973822", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-973822", "inbound_nodes": [[["Add-660458", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-155835", "trainable": true, "dtype": "float32", "filters": 1024, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-155835", "inbound_nodes": [[["Conv2D-973822", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-545709", "trainable": true, "dtype": "float32"}, "name": "Add-545709", "inbound_nodes": [[["Conv2D-973822", 0, 0, {}], ["Conv2D-155835", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-711722", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-711722", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-289103", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-289103", "inbound_nodes": [[["Add-545709", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-476075", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-476075", "inbound_nodes": [[["Flatten-711722", 0, 0, {}], ["Flatten-289103", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-806214", "trainable": true, "dtype": "float32", "units": 1024, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-806214", "inbound_nodes": [[["Concat-476075", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-75739", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-75739", "inbound_nodes": [[["Flatten-711722", 0, 0, {}], ["Dense-806214", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-885863", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-885863", "inbound_nodes": [[["Concat-75739", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Dense-output-562709", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Dense-output-562709", "inbound_nodes": [[["Flatten-711722", 0, 0, {}], ["Dense-885863", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1837, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Dense-output-562709", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of7.bin", "group1-shard2of7.bin", "group1-shard3of7.bin", "group1-shard4of7.bin", "group1-shard5of7.bin", "group1-shard6of7.bin", "group1-shard7of7.bin"], "weights": [{"name": "Conv2D-155835/kernel", "shape": [3, 3, 1024, 1024], "dtype": "float32"}, {"name": "Conv2D-155835/bias", "shape": [1024], "dtype": "float32"}, {"name": "Conv2D-519806/kernel", "shape": [3, 3, 16, 64], "dtype": "float32"}, {"name": "Conv2D-519806/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv2D-576606/kernel", "shape": [3, 3, 64, 256], "dtype": "float32"}, {"name": "Conv2D-576606/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv2D-623257/kernel", "shape": [3, 3, 14, 16], "dtype": "float32"}, {"name": "Conv2D-623257/bias", "shape": [16], "dtype": "float32"}, {"name": "Conv2D-719310/kernel", "shape": [3, 3, 64, 64], "dtype": "float32"}, {"name": "Conv2D-719310/bias", "shape": [64], "dtype": "float32"}, {"name": "Conv2D-844998/kernel", "shape": [3, 3, 256, 256], "dtype": "float32"}, {"name": "Conv2D-844998/bias", "shape": [256], "dtype": "float32"}, {"name": "Conv2D-973822/kernel", "shape": [3, 3, 256, 1024], "dtype": "float32"}, {"name": "Conv2D-973822/bias", "shape": [1024], "dtype": "float32"}, {"name": "Conv2D-999900/kernel", "shape": [3, 3, 16, 16], "dtype": "float32"}, {"name": "Conv2D-999900/bias", "shape": [16], "dtype": "float32"}, {"name": "Dense-806214/kernel", "shape": [66432, 1024], "dtype": "float32"}, {"name": "Dense-806214/bias", "shape": [1024], "dtype": "float32"}, {"name": "Dense-885863/kernel", "shape": [1920, 512], "dtype": "float32"}, {"name": "Dense-885863/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1408, 1837], "dtype": "float32"}, {"name": "dense/bias", "shape": [1837], "dtype": "float32"}]}]}