{"format": "layers-model", "generatedBy": "keras v2.11.0", "convertedBy": "TensorFlow.js Converter v4.4.0", "modelTopology": {"keras_version": "2.11.0", "backend": "tensorflow", "model_config": {"class_name": "Functional", "config": {"name": "model", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 8, 8, 14], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}, "name": "input_1", "inbound_nodes": []}, {"class_name": "Conv2D", "config": {"name": "Conv2D-549562", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-549562", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-968457", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-968457", "inbound_nodes": [[["Conv2D-549562", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-354391", "trainable": true, "dtype": "float32"}, "name": "Add-354391", "inbound_nodes": [[["Conv2D-549562", 0, 0, {}], ["Conv2D-968457", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-779623", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-779623", "inbound_nodes": [[["Add-354391", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-322375", "trainable": true, "dtype": "float32", "filters": 96, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-322375", "inbound_nodes": [[["Conv2D-779623", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-91764", "trainable": true, "dtype": "float32"}, "name": "Add-91764", "inbound_nodes": [[["Conv2D-779623", 0, 0, {}], ["Conv2D-322375", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-654217", "trainable": true, "dtype": "float32", "filters": 288, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-654217", "inbound_nodes": [[["Add-91764", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-687403", "trainable": true, "dtype": "float32", "filters": 288, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-687403", "inbound_nodes": [[["Conv2D-654217", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-953965", "trainable": true, "dtype": "float32"}, "name": "Add-953965", "inbound_nodes": [[["Conv2D-654217", 0, 0, {}], ["Conv2D-687403", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-802669", "trainable": true, "dtype": "float32", "filters": 864, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-802669", "inbound_nodes": [[["Add-953965", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Conv2D-931188", "trainable": true, "dtype": "float32", "filters": 864, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Conv2D-931188", "inbound_nodes": [[["Conv2D-802669", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "Add-552863", "trainable": true, "dtype": "float32"}, "name": "Add-552863", "inbound_nodes": [[["Conv2D-802669", 0, 0, {}], ["Conv2D-931188", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-105365", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-105365", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Flatten", "config": {"name": "Flatten-347496", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "name": "Flatten-347496", "inbound_nodes": [[["Add-552863", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-120011", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-120011", "inbound_nodes": [[["Flatten-105365", 0, 0, {}], ["Flatten-347496", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-567538", "trainable": true, "dtype": "float32", "units": 1024, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-567538", "inbound_nodes": [[["Concat-120011", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Concat-804548", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Concat-804548", "inbound_nodes": [[["Flatten-105365", 0, 0, {}], ["Dense-567538", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "Dense-908069", "trainable": true, "dtype": "float32", "units": 512, "activation": {"class_name": "ELU", "config": {"name": "elu", "trainable": true, "dtype": "float32", "alpha": 1.0}, "shared_object_id": 32}, "use_bias": true, "kernel_initializer": {"class_name": "HeNormal", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Dense-908069", "inbound_nodes": [[["Concat-804548", 0, 0, {}]]]}, {"class_name": "Concatenate", "config": {"name": "Dense-output-860280", "trainable": true, "dtype": "float32", "axis": -1}, "name": "Dense-output-860280", "inbound_nodes": [[["Flatten-105365", 0, 0, {}], ["Dense-908069", 0, 0, {}]]]}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 1837, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "dense", "inbound_nodes": [[["Dense-output-860280", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["dense", 0, 0]]}}}, "weightsManifest": [{"paths": ["group1-shard1of6.bin", "group1-shard2of6.bin", "group1-shard3of6.bin", "group1-shard4of6.bin", "group1-shard5of6.bin", "group1-shard6of6.bin"], "weights": [{"name": "Conv2D-322375/kernel", "shape": [3, 3, 96, 96], "dtype": "float32"}, {"name": "Conv2D-322375/bias", "shape": [96], "dtype": "float32"}, {"name": "Conv2D-549562/kernel", "shape": [3, 3, 14, 32], "dtype": "float32"}, {"name": "Conv2D-549562/bias", "shape": [32], "dtype": "float32"}, {"name": "Conv2D-654217/kernel", "shape": [3, 3, 96, 288], "dtype": "float32"}, {"name": "Conv2D-654217/bias", "shape": [288], "dtype": "float32"}, {"name": "Conv2D-687403/kernel", "shape": [3, 3, 288, 288], "dtype": "float32"}, {"name": "Conv2D-687403/bias", "shape": [288], "dtype": "float32"}, {"name": "Conv2D-779623/kernel", "shape": [3, 3, 32, 96], "dtype": "float32"}, {"name": "Conv2D-779623/bias", "shape": [96], "dtype": "float32"}, {"name": "Conv2D-802669/kernel", "shape": [3, 3, 288, 864], "dtype": "float32"}, {"name": "Conv2D-802669/bias", "shape": [864], "dtype": "float32"}, {"name": "Conv2D-931188/kernel", "shape": [3, 3, 864, 864], "dtype": "float32"}, {"name": "Conv2D-931188/bias", "shape": [864], "dtype": "float32"}, {"name": "Conv2D-968457/kernel", "shape": [3, 3, 32, 32], "dtype": "float32"}, {"name": "Conv2D-968457/bias", "shape": [32], "dtype": "float32"}, {"name": "Dense-567538/kernel", "shape": [56192, 1024], "dtype": "float32"}, {"name": "Dense-567538/bias", "shape": [1024], "dtype": "float32"}, {"name": "Dense-908069/kernel", "shape": [1920, 512], "dtype": "float32"}, {"name": "Dense-908069/bias", "shape": [512], "dtype": "float32"}, {"name": "dense/kernel", "shape": [1408, 1837], "dtype": "float32"}, {"name": "dense/bias", "shape": [1837], "dtype": "float32"}]}]}